In [28]:
import pandas as pd

friends = [{'age':15, 'job': 'student'},
          {'age':25, 'job': 'developer'},
          {'age':30, 'job': 'teacher'}]

df = pd.DataFrame(friends,
                 index=['John', 'Jenny', 'Nate'],
                 columns = ['age', 'job'])

In [29]:
df

       age        job
John    15    student
Jenny   25  developer
Nate    30    teacher

In [30]:
df.drop(['John', 'Nate'])

       age        job
Jenny   25  developer

In [31]:
df

       age        job
John    15    student
Jenny   25  developer
Nate    30    teacher

In [32]:
df = df.drop(['John', 'Nate'])

In [33]:
df

       age        job
Jenny   25  developer

In [34]:
df = pd.DataFrame(friends,
                 index=['John', 'Jenny', 'Nate'],
                 columns = ['age', 'job'])

In [35]:
df

       age        job
John    15    student
Jenny   25  developer
Nate    30    teacher

In [36]:
df.drop(['John', 'Nate'], inplace = True) # drop한 value가 바로 적용됨

In [37]:
df

       age        job
Jenny   25  developer

In [41]:
friends = [{'name': 'John', 'age':15, 'job': 'student'},
          {'name': 'Ben', 'age':25, 'job': 'developer'},
          {'name': 'Jenny', 'age':30, 'job': 'teacher'}]

df = pd.DataFrame(friends,
                 columns = ['name','age', 'job'])

In [42]:
df

    name  age        job
0   John   15    student
1    Ben   25  developer
2  Jenny   30    teacher

In [43]:
df = df.drop(df.index[[0,2]])

In [44]:
df

  name  age        job
1  Ben   25  developer

In [45]:
df = pd.DataFrame(friends,
                 columns = ['name','age', 'job'])

In [46]:
df

    name  age        job
0   John   15    student
1    Ben   25  developer
2  Jenny   30    teacher

In [47]:
df = df[df.age > 20]

In [48]:
df

    name  age        job
1    Ben   25  developer
2  Jenny   30    teacher

In [49]:
df = pd.DataFrame(friends,
                 columns = ['name','age', 'job'])

In [50]:
df

    name  age        job
0   John   15    student
1    Ben   25  developer
2  Jenny   30    teacher

In [51]:
df = df.drop('age', axis = 1)

In [52]:
df

    name        job
0   John    student
1    Ben  developer
2  Jenny    teacher

In [53]:
df = pd.DataFrame(friends,
                 columns = ['name','age', 'job'])

In [54]:
df

    name  age        job
0   John   15    student
1    Ben   25  developer
2  Jenny   30    teacher

In [55]:
df.drop('age', axis = 1, inplace = True)

In [56]:
df

    name        job
0   John    student
1    Ben  developer
2  Jenny    teacher